class PikInFilter:


    expected_types = [
        "Технические проблемы",
        "Претензия",
        "Консультация",
        "Услуги",
    ]
    expected_areas_in_technical_problems = [
        "Проблемы с фискализацией",
        "Сбойный заказ",
        "Списание бонусов",
    ]
    expected_areas_in_claim = [
        "Covid-19",
        "Возврат А/Б",
        "Выбор места",
        "Изменение класса обслуживания",
        "Питание",
        "Прочее",
        "Ручная кладь/багаж"
    ]
    expected_areas_in_consultation_in_filter = [
        "Багаж/Ручная кладь",
        "Доп. услуги",
        "Другое",
        "Консультация по возврату",
        "Консультация по претензии",
        "Подтверждение покупки билета",
        "Правила перевозки",
        "Программа лояльности Крылья",
        "Расписание",
        "Регистрация",
        "Справки о перелете",
        "Субсидии/Акции"
    ]
    expected_areas_in_services_in_filter = [
        "Багаж",
        "Дети",
        "Документы для перелета",
        "Животные",
        "Заказ справки",
        "Запрос фискального чека",
        "Начисление бонусов",
        "Обратный звонок",
        "Обратный звонок (Субсидии)",
        "Отмена/Задержка рейса",
        "Отправка м/к",
        "Ошибка в билете",
        "Ошибка в билете (Субсидии)",
        "Переоформление билета",
        "Подтверждение профиля",
        "Покупка билета",
        "Покупка билета/Сертификаты",
        "Покупка доп. услуг",
        "Понижение класса обслуживания",
        "Произвести возврат",
        "Прослушка звонка",
        "Разблокировка бонусов"
    ]

    list_of_queue = [
        "Очередь операторов",
        "Очередь кассиров",
        "Претензии",
        "Справки",
        "Возвраты",
        "Обратный звонок (Субсидии)",
        "Фискализация чеков",
        "Начисление бонусов",
        "Прослушка звонка",
        "Прослушка звонка (В работе)",
        "Мои запросы",
        "Все претензии",
        "Все запросы"
    ]

    expected_areas_in_consultation_in_creating_new_request = [
        "Доп. услуги",
        "Консультация по возврату",
        "Подтверждение покупки билета",
        "Правила перевозки",
        "Программа лояльности Крылья",
        "Регистрация",
        "Справки о перелете",
]

    expected_areas_in_services_in_creating_new_request = [
        "Багаж",
        "Заказ справки",
        "Запрос фискального чека",
        "Начисление бонусов",
        "Обратный звонок",
        "Отправка м/к",
        "Ошибка в билете",
        "Ошибка в билете (Субсидии)",
        "Переоформление билета",
        "Подтверждение профиля",
        "Покупка билета",
        "Покупка доп. услуг",
        "Понижение класса обслуживания",
        "Произвести возврат",
        "Прослушка звонка",
        "Разблокировка бонусов"
    ]